## 第六章 数据载入、存储及文件格式

### 6.1 文本格式数据的读写

In [1]:
import pandas as pd

In [6]:
!type .\examples\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [7]:
df = pd.read_csv('.\examples\ex1.csv')

In [8]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
pd.read_table('.\examples\ex1.csv',sep = ',')

C:\Users\sugarLiu\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
!type .\examples\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [13]:
pd.read_csv('.\examples\ex2.csv',header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [14]:
pd.read_csv('.\examples\ex2.csv',names = ['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
names =  ['a','b','c','d','message']

In [18]:
pd.read_csv('.\examples\ex2.csv',names = names, index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [19]:
!type .\examples\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [20]:
parsed = pd.read_csv('.\examples\csv_mindex.csv', index_col = ['key1','key2'])

In [21]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [23]:
list(open('.\examples\ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491']

In [24]:
result = pd.read_table('.\examples\ex3.txt', sep = '\s+')

C:\Users\sugarLiu\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

In [25]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [27]:
!type .\examples\ex4.csv

# 嘿！
a,b,c,d,message
# 只是为了让你觉得更难
# 谁用计算机读取CSV文件？
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [28]:
pd.read_csv('.\examples\ex4.csv', skiprows = [0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [29]:
!type .\examples\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,7,8,world
three,9,10,11,12,foo

In [33]:
result = pd.read_csv('.\examples\ex5.csv')

In [34]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [35]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [36]:
result = pd.read_csv('.\examples\ex5.csv',na_values = ['NULL'])

In [37]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [38]:
sentinels = {'message':['foo','NA'],'something':['two']}

In [39]:
result = pd.read_csv('.\examples\ex5.csv',na_values = sentinels)

In [40]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [41]:
pd.options.display.max_rows = 10

In [42]:
result = pd.read_csv('.\examples\ex6.csv')

In [43]:
result = pd.read_csv('.\examples\ex6.csv',nrows = 5)

In [44]:
result

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [45]:
chunker = pd.read_csv('.\examples\ex6.csv',chunksize = 1000)

In [46]:
chunker

In [48]:
tot = pd.Series([])

In [49]:
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value = 0)

In [50]:
tot = tot.sort_values(ascending = False)

In [51]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [52]:
data = pd.read_csv('.\examples\ex5.csv')

In [53]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [55]:
data.to_csv('.\examples\out.csv')

In [56]:
!type .\examples\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [57]:
import sys

In [58]:
data.to_csv(sys.stdout, sep = '|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [60]:
data.to_csv(sys.stdout, na_rep = 'NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [61]:
data.to_csv(sys.stdout,index = False, header = False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [62]:
data.to_csv(sys.stdout,index = False, columns = ['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [63]:
dates = pd.date_range('1/1/2000',periods = 7)

In [65]:
import numpy as np

In [66]:
ts = pd.Series(np.arange(7),index = dates)

In [76]:
ts.to_csv('examples/tseries.csv')

C:\Users\sugarLiu\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [78]:
!type .\examples\tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [79]:
!type .\examples\ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [80]:
import csv

In [81]:
f = open('.\examples\ex7.csv')

In [82]:
reader = csv.reader(f)

In [83]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [84]:
with open('.\examples\ex7.csv') as f:
    lines = list(csv.reader(f))

In [85]:
header,values = lines[0],lines[1:]

In [86]:
header

['a', 'b', 'c']

In [87]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [89]:
data_dict = {h: v for h, v in zip(header,zip(* values))}

In [90]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [92]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [94]:
f = open('.\examples\ex7.csv')

In [95]:
reader = csv.reader(f, dialect = my_dialect)

In [96]:
reader = csv.reader(f,delimiter = '|')

In [99]:
with open('mydata.csv','w') as f:
    writer = csv.writer(f, dialect = my_dialect)
    writer.writerow(('one','two','three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('1','2','3'))
    writer.writerow(('1','2','3'))

In [101]:
!type mydata.csv

one;two;three
1;2;3
1;2;3
1;2;3

In [102]:
obj = """
{
"name":"Wes",
"places_lived": ["United States","Spain","Germany"],
"pet":null,
"siblings":[
{"name": "Scott", "age":30, "pets":["Zeus","Zuko"]},
{"name": "Katie", "age":38, "pets":["Sixes","Stache","Cisco"]}
]
}"""

In [103]:
import json

In [104]:
result = json.loads(obj)

In [105]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [106]:
asjson = json.dumps(result)

In [107]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [108]:
siblings = pd.DataFrame(result['siblings'], columns = ['name','age'])

In [109]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [110]:
!type .\examples\example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [111]:
data = pd.read_json('.\examples\example.json')

In [112]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [114]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [117]:
print(data.to_json(orient = 'records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [120]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [121]:
len(tables)

1

In [122]:
failures = tables[0]

In [123]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [124]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [125]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [126]:
from lxml import objectify

In [135]:
path = 'examples\mta_perf\Performance_MNR.xml'

In [136]:
parsed = objectify.parse(open(path))

In [137]:
root = parsed.getroot()

In [138]:
data = []

In [139]:
skip_fields = ['PARENT_SEQ','INDICATOR_SEQ','DESIRED_CHANGE','DECIMAL_PLACES']

In [140]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [141]:
perf = pd.DataFrame(data)

In [142]:
perf.head()

,AGENCY_NAME,CATEGORY,DESCRIPTION,FREQUENCY,INDICATOR_NAME,INDICATOR_UNIT,MONTHLY_ACTUAL,MONTHLY_TARGET,PERIOD_MONTH,PERIOD_YEAR,YTD_ACTUAL,YTD_TARGET
0,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,1,2008,96.9,95
1,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95,95,2,2008,96,95
2,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,3,2008,96.3,95
3,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,98.3,95,4,2008,96.8,95
4,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95.8,95,5,2008,96.6,95

In [144]:
from io import StringIO

In [145]:
tag = '<a herf="http:/www.google.com">Google</a>'

In [147]:
root = objectify.parse(StringIO(tag)).getroot()

In [148]:
root

In [149]:
root.get('herf')

'http:/www.google.com'

In [150]:
root.text

'Google'

### 6.2 二进制格式

In [152]:
frame = pd.read_csv('examples\ex1.csv')

In [153]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [154]:
frame.to_pickle('examples\ex1.csv')

In [155]:
pd.read_pickle('examples\ex1.csv')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [156]:
frame = pd.DataFrame({'a':np.random.randn(100)})

In [158]:
store = pd.HDFStore('mydata.h5')

In [160]:
store['obj1'] = frame

In [161]:
store['obj1_col'] = frame['a']

In [162]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [163]:
store['obj1']

           a
0  -0.826163
1   0.253127
2  -1.004985
3   1.248649
4   0.273652
..       ...
95  1.260039
96  1.465669
97 -1.292403
98  0.522868
99  0.411914

[100 rows x 1 columns]

In [164]:
store.put('obj2',frame, format = 'table')

In [165]:
store.select('obj2',where = ['index >= 10 and index <=15'])

           a
10 -0.424238
11  0.812311
12 -0.528081
13 -2.293150
14  0.653697
15  0.444311

In [166]:
store.close()

In [167]:
frame.to_hdf('mydata.h5', 'obj3', format = 'table')

In [168]:
pd.read_hdf('mydata.h5', 'obj3', where = ['index < 5'])

          a
0 -0.826163
1  0.253127
2 -1.004985
3  1.248649
4  0.273652

In [171]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [172]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [173]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [174]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [175]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [176]:
frame.to_excel(writer,'Sheet1')

In [177]:
writer.save()

In [178]:
frame.to_excel('examples/ex2.xlsx')

### 6.3 与Web API 交互

In [12]:
import pandas as pd

In [1]:
import requests

In [2]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [4]:
resp = requests.get(url)

In [6]:
resp

In [7]:
data = resp.json()

In [9]:
data[0]['title']

'DOC: clarify that read_parquet accepts a directory path'

In [13]:
issues = pd.DataFrame(data, columns = ['number','title','labels''state'])

In [14]:
issues

    number                                              title  labelsstate
0    27820  DOC: clarify that read_parquet accepts a direc...          NaN
1    27819  Backport PR #27809 on branch 0.25.x (CI: remov...          NaN
2    27818  COMPAT: restore shape for 'invalid' Index with...          NaN
3    27817  Conversion from Arrow to datetime not working ...          NaN
4    27816                DatetimeIndex shift freq ValueError          NaN
5    27815           REF: implement should_extension_dispatch          NaN
6    27814  BUG: Series.rename raises error on values acce...          NaN
7    27813  BUG: Series.rename raises error on values acce...          NaN
8    27812  BUG:No xlabel  for twinx axes in subploted fig...          NaN
9    27811             REF: separate method-pinning functions          NaN
10   27810            TST: skip test if running non-installed          NaN
11   27808  [WIP] VIS: Fix DataFrame.plot() produces incor...          NaN
12   27807      BUG: fix+test op(NaT, ndarray), also simplify          NaN
13   27805  DataFrame and Series iterators have many incon...          NaN
14   27804           [WIP] Improve CI/CD pipeline performance          NaN
15   27803                  REF: Simplify _comp_method_SERIES          NaN
16   27802  DOC: Series.str.slice() should show that negat...          NaN
17   27801           [ENH] Add argmax, max, argmin, min to EA          NaN
18   27800  BUG: aggregation on ordered categorical column...          NaN
19   27799  BUG: pivot_table fails with aggfunc='size' and...          NaN
20   27796            Missing spaces between lines and y-axis          NaN
21   27794  Min/max does not work for dates with timezones...          NaN
22   27791                             CLN: Assorted Cleanups          NaN
23   27790  BUG: Increase range of dates for holiday calcu...          NaN
24   27784  ENH: allow object-dtype Index to do arithmetic...          NaN
25   27781  Filtering dataframe with sparse column leads t...          NaN
26   27780                         DOC: Add CoC to the README          NaN
27   27779  Give more precise warning when passing `header...          NaN
28   27778  ENH: allow new column names argument in DataFr...          NaN
29   27777                            Avoid calling S3File.s3          NaN

### 6.4 与数据库交互

In [192]:
import sqlite3

In [193]:
query = """
CREATE TABLE test
(a VARCHAR(20),b VARCHAR(20),c REAL, d INTEGER
);
"""

In [194]:
con = sqlite3.connect('mydata.sqlite')

In [195]:
con.execute(query)

In [197]:
con.commit()

In [198]:
data = [('Altlanta','Georgia',1.25,6),
        ('Tallahassee','Florida',2.6,3),
        ('Sacramento','California',1.7,5)
       ]

In [199]:
stmt = "INSERT INTO test VALUES(?,?,?,?)"

In [200]:
con.executemany(stmt,data)

In [201]:
con.commit()

In [202]:
cursor = con.execute('select * from test')

In [203]:
rows = cursor.fetchall()

In [204]:
rows

[('Altlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [205]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [206]:
pd.DataFrame(rows,columns = [x[0] for x in cursor.description])

             a           b     c  d
0     Altlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [207]:
import sqlalchemy as sqla

In [208]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [211]:
pd.read_sql('select * from test',db)

             a           b     c  d
0     Altlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5